
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.План.Количество() = 0 Тогда
		
		Отказ = Истина;
		
	КонецЕсли;                           
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СоздатьДвиженияПоРегиструПланаРасхода();
	
КонецПроцедуры

Процедура СоздатьДвиженияПоРегиструПланаРасхода()
	
	ОбработкаУдаленияПроведения(Ложь);
	НаборЗаписей = РегистрыНакопления.ПланРасходаДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для каждого Стр Из ЭтотОбъект.План Цикл  
		
		НСтр = НаборЗаписей.Добавить();
		НСтр.Регистратор = ЭтотОбъект.Ссылка;
		НСтр.ВидДвижения = ВидДвиженияНакопления.Приход;
		НСтр.Период = ЭтотОбъект.Дата; 
		НСтр.ЧленСемьи = Стр.ЧленСемьи;
		НСтр.ВидДС = Стр.ВидДС;
		НСтр.СтатьяРасходов = Стр.СтатьяРасходов;
		НСтр.Сумма = Стр.Сумма;	
	
	КонецЦикла;                        
	
	НаборЗаписей.Записать();
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыНакопления.ПланРасходаДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

