#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.Элементы.Группа1.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
		ЭтаФорма.ВыборРасшифровки = 1;
		Возврат;	
	КонецЕсли;  
	
	Если Объект.Списания.Количество() = 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 1;
		ЭтаФорма.Элементы.Группа1.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
        ЗаполнитьПоляГруппыБезРасшифровки();
	ИначеЕсли Объект.Списания.Количество() > 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 2;
		ЭтаФорма.Элементы.Группа1.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
	КонецЕсли;      
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиЭлементовФормы
&НаКлиенте
Процедура РасшифровкаПриИзменении(Элемент)
	
	Если ВыборРасшифровки = 1 Тогда
		ЭтаФорма.Элементы.Группа1.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
		ЗаполнитьПоляГруппыБезРасшифровки();
	Иначе
		ЭтаФорма.Элементы.Группа1.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
		ЗаполнитьРасшифровкуСписком();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзменении(Элемент)  
	
	РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияВидДСПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСтатьяРасходовПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСтатьяРасходовПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСуммаПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере(); 
	
КонецПроцедуры
#КонецОбласти

#Область Служебные
&НаСервере
Процедура РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	Иначе
		Объект.Списания[0].ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСтатьяРасходовПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.СтатьяРасходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяРасходов;
	Иначе
		Объект.Списания[0].СтатьяРасходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяРасходов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	Иначе
		Объект.Списания[0].Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоляГруппыБезРасшифровки()
	
	ЭтотОбъект.РасшифровкаБезРазбиенияВидДС = Объект.Списания[0].ВидДС;
	ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяРасходов = Объект.Списания[0].СтатьяРасходов;
	ЭтотОбъект.РасшифровкаБезРазбиенияСумма = Объект.Списания[0].Сумма;
	ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи = Объект.Списания[0].ЧленСемьи;
	ЗаполнитьРасшифровкуСписком();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРасшифровкуСписком() 
	
	Объект.Списания.Очистить();
	НСтр = Объект.Списания.Добавить();
	НСтр.ВидДС = РасшифровкаБезРазбиенияВидДС;
	НСтр.СтатьяРасходов = РасшифровкаБезРазбиенияСтатьяРасходов;
	НСтр.Сумма = РасшифровкаБезРазбиенияСумма;
	НСтр.ЧленСемьи = РасшифровкаБезРазбиенияЧленСемьи;	
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере()
	
	Если Объект.Списания.Количество() = 0 Тогда
		НСтр = Объект.Списания.Добавить();
		НСтр.ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	Иначе
		Объект.Списания[0].ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	КонецЕсли;                                                                        
	
КонецПроцедуры
#КонецОбласти
