#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.Элементы.Группа3.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
		ЭтаФорма.ВыборРасшифровки = 1;
		Возврат;	
	КонецЕсли;  
	
	Если Объект.Поступления.Количество() = 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 1;
		ЭтаФорма.Элементы.Группа3.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
        ЗаполнитьПоляГруппыБезРасшифровки();
	ИначеЕсли Объект.Поступления.Количество() > 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 2;
		ЭтаФорма.Элементы.Группа3.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
	КонецЕсли;      
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиЭлементовФормы
&НаКлиенте
Процедура РасшифровкаПриИзменении(Элемент)
	
	Если ВыборРасшифровки = 1 Тогда
		ЭтаФорма.Элементы.Группа3.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
		ЗаполнитьПоляГруппыБезРасшифровки();
	Иначе
		ЭтаФорма.Элементы.Группа3.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
		ЗаполнитьРасшифровкуСписком();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзменении(Элемент)  
	
	РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияВидДСПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСтатьяДоходовПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСтатьяДоходовПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСуммаПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере(); 
	
КонецПроцедуры
#КонецОбласти

#Область Служебные
&НаСервере
Процедура РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	Иначе
		Объект.Поступления[0].ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСтатьяДоходовПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.СтатьяДоходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяДоходов;
	Иначе
		Объект.Поступления[0].СтатьяДоходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяДоходов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	Иначе
		Объект.Поступления[0].Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоляГруппыБезРасшифровки()
	
	ЭтотОбъект.РасшифровкаБезРазбиенияВидДС = Объект.Поступления[0].ВидДС;
	ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяДоходов = Объект.Поступления[0].СтатьяДоходов;
	ЭтотОбъект.РасшифровкаБезРазбиенияСумма = Объект.Поступления[0].Сумма;
	ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи = Объект.Поступления[0].ЧленСемьи;
	ЗаполнитьРасшифровкуСписком();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРасшифровкуСписком() 
	
	Объект.Поступления.Очистить();
	НСтр = Объект.Поступления.Добавить();
	НСтр.ВидДС = РасшифровкаБезРазбиенияВидДС;
	НСтр.СтатьяДоходов = РасшифровкаБезРазбиенияСтатьяДоходов;
	НСтр.Сумма = РасшифровкаБезРазбиенияСумма;
	НСтр.ЧленСемьи = РасшифровкаБезРазбиенияЧленСемьи;	
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	Иначе
		Объект.Поступления[0].ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	КонецЕсли;                                                                        
	
КонецПроцедуры
#КонецОбласти
