
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Поступления.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СоздатьДвиженияПоРегиструДвиженийДС();
	СоздатьДвиженияПоРегиструПоступленийДС();
	
КонецПроцедуры   

Процедура СоздатьДвиженияПоРегиструДвиженийДС()
	
	УдалитьДвиженияПоРегиструДвиженийДС();
	НаборЗаписей = РегистрыНакопления.ДвиженияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для каждого Стр Из ЭтотОбъект.Поступления Цикл
		
		НСтр = НаборЗаписей.Добавить();    
		НСтр.Регистратор = ЭтотОбъект.Ссылка;
		НСтр.ВидДвижения = ВидДвиженияНакопления.Приход;
	    НСтр.Период = ЭтотОбъект.Дата;
		НСтр.ЧленСемьи = Стр.ЧленСемьи;
		НСтр.ВидДС = Стр.ВидДС;
		НСтр.Сумма = Стр.Сумма;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры 

Процедура СоздатьДвиженияПоРегиструПоступленийДС()

	УдалитьДвиженияПоРегиструПоступленийДС();
	НаборЗаписей = РегистрыНакопления.ПоступенияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для каждого Стр Из ЭтотОбъект.Поступления Цикл
		
		НСтр = НаборЗаписей.Добавить();    
		НСтр.Регистратор = ЭтотОбъект.Ссылка;
	    НСтр.Период = ЭтотОбъект.Дата;
		НСтр.ЧленСемьи = Стр.ЧленСемьи;
		НСтр.ВидДС = Стр.ВидДС; 
		НСтр.СтатьяДоходов = Стр.СтатьяДоходов;
		НСтр.Сумма = Стр.Сумма;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	
КонецПроцедуры



Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УдалитьДвиженияПоРегиструДвиженийДС(); 
	УдалитьДвиженияПоРегиструПоступленийДС();
	
КонецПроцедуры

Процедура УдалитьДвиженияПоРегиструДвиженийДС()
	
	НаборЗаписей = РегистрыНакопления.ДвиженияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьДвиженияПоРегиструПоступленийДС()
	
	НаборЗаписей = РегистрыНакопления.ПоступенияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры
